       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * test
       COPY THENAME.

       PROCEDURE DIVISION.
           DISPLAY "Hello " THE-NAME
           DISPLAY "Hello World"

           GOBACK.